# PointCloudColorSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudColorSettings Methods
PointCloudColorSettings Class See Also
---
The PointCloudColorSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Assign | Assigns values of the source settings to this object. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Check if the contents of two settings are equal. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace